GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/m66.c
/*+CGATT:1*/
rt_err_t pt_resp_CGATT( char *p, uint16_t len )
{
	char *pfind = RT_NULL;
	pfind = strstr( p, "+CGATT: 1" );
	if( pfind )
	{
		return RT_EOK;
	}
	return RT_ERROR;
}

/*%ETCPIP:1,"10.24.44.142","0.0.0.0","0.0.0.0"*/
rt_err_t pt_resp_ETCPIP( char *p, uint16_t len )
{
	rt_err_t	res		= RT_ERROR;
	uint8_t		stage	= 0;
	char		*psrc	= p;
	char		*pdst	= gsm_param.ip;

	while( 1 )
	{
		if( stage == 0 )
		{
			if( *psrc == '"' )
			{
				stage = 1;
			}
			psrc++;
		}else
		{
			if( *psrc == '"' )
			{
				break;
			}
			*pdst = *psrc;
			pdst++;
			psrc++;
		}
	}
	rt_kprintf( "ip=%s\r\n", gsm_param.ip );
	return RT_EOK;
}

/*
   AT%DNSR="www.google.com"
   %DNSR:74.125.153.147
   OK
 */
rt_err_t pt_resp_DNSR( char *p, uint16_t len )
{
	uint8_t i, stage = 0;
	char	*psrc = p;
	char	*pdst;
	if( strstr( p, "%DNSR" ) == RT_NULL )
	{
		return RT_ERROR;
	}
	while( 1 )
	{
		if( stage == 0 )
		{
			if( *psrc == ':' )
			{
				for( i = 0; i < 4; i++ )
				{
					if( psocket->state == SOCKET_DNS )
					{
						pdst = psocket->ip_addr;
						break;
					}
				}
				stage = 1;
			}
			psrc++;
		}else
		{
			if( *psrc <= 0x20 )
			{
				break;
			}
			*pdst = *psrc;
			pdst++;
			psrc++;
		}
	}
	rt_kprintf( "dns ip=%s\r\n", psocket->ip_addr );
	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t pt_resp_IPOPENX( char *p, uint16_t len )
{
	uint8_t i;
	char	*psrc = p;
	char	*pdst;

	if( strstr( p, "CONNECT" ) != RT_NULL )
	{
		return RT_EOK;
	}
	return RT_ERROR;
}

/*通用检查函数，看是否收到数据，如果有数据后再判断*/
rt_err_t pt_resp( RESP_FUNC func )
{
	char		*pstr;
	uint16_t	len;
	rt_err_t	ret;
	ret = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pstr, 0 );
	if( ret == -RT_ETIMEOUT )
	{
		return RT_ETIMEOUT;
	}
/*有应答，执行相应的函数*/
	len = ( ( *pstr ) << 8 ) | ( *( pstr + 1 ) );
	ret = func( pstr + 2, len );
//	rt_kprintf( "pt_resp ret=%x\r\n", ret );
	rt_free( pstr );
	return ret;
}

typedef rt_err_t ( *AT_RESP )( char *p, uint16_t len );
typedef struct
{
	char		*atcmd;
	AT_RESP		resp;
	uint16_t	timeout;
	uint16_t	retry;
}AT_CMD_RESP;



/*等待固定字符串的返回*/
rt_err_t WaitString(char *respstr,uint32_t timeout)
{
	rt_err_t	err;
	
	char		*pmsg;
	uint32_t	tick_start, tick_end;
	uint32_t	tm;	
	__IO uint8_t flag_wait=1;


	tick_start=rt_tick_get();
	tick_end=tick_start+timeout;
	tm=timeout;
	
	while( flag_wait )
	{
		err = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pmsg, tm );
		if( err != -RT_ETIMEOUT )						/*没有超时,判断信息是否正确*/
		{
			if( strstr( pmsg, respstr ) != RT_NULL )	/*找到了*/
			{
				rt_free(pmsg);	/*释放*/
				return RT_EOK;
			} 
			rt_free(pmsg);	/*释放*/
			/*计算剩下的超时时间,由于其他任务执行的延时，会溢出,要判断*/
			if(rt_tick_get()<tick_end)	/*还没有超时*/
			{
				tm = tick_end-rt_tick_get();
			}
			else
			{
				flag_wait=0;
			}
		}else	/*已经超时*/
		{
			flag_wait=0;
		}
	}
	return RT_ETIMEOUT;

}



/*
   发送AT命令，并等待响应字符串
   参照 code.google.com/p/gsm-playground的实现
 */
rt_err_t SendATCmdWaitRespStr( char *AT_cmd_string,
                               uint32_t timeout,
                               char * respstr,
                               uint8_t no_of_attempts )
{
	rt_err_t	err;
	uint8_t		i;
	char		*pmsg;
	uint32_t	tick_start, tick_end;
	uint32_t	tm;
	__IO uint8_t flag_wait;

	for( i = 0; i < no_of_attempts; i++ )
	{
		tick_start	= rt_tick_get( );
		tick_end	= tick_start + timeout;
		tm			= timeout;
		flag_wait=1;
		m66_write( &dev_gsm, 0, AT_cmd_string, strlen( AT_cmd_string ) );
		while( flag_wait )
		{
			err = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pmsg, tm );
			if( err != -RT_ETIMEOUT )                       /*没有超时,判断信息是否正确*/
			{
				if( strstr( pmsg, respstr ) != RT_NULL )    /*找到了*/
				{
					rt_free(pmsg);	/*释放*/
					return RT_EOK;
				} 
				rt_free(pmsg);	/*释放*/
				/*计算剩下的超时时间,由于其他任务执行的延时，会溢出,要判断*/
				if(rt_tick_get()<tick_end)	/*还没有超时*/
				{
					tm = tick_end-rt_tick_get();
				}
				else
				{
					flag_wait=0;
				}
			}else	/*已经超时*/
			{
				flag_wait=0;
			}
		}
	}
	return ( RT_ETIMEOUT );
}

/*
   发送AT命令，并等待响应函数处理
   参照 code.google.com/p/gsm-playground的实现
 */

int8_t SendATCmdWaitRespFunc( char *AT_cmd_string,
                              uint32_t timeout,
                              RESP_FUNC respfunc,
                              uint8_t no_of_attempts )
{
	rt_err_t	err;
	uint8_t		i;
	char		*pmsg;
	uint32_t	tick_start, tick_end;
	uint32_t	tm;
	__IO uint8_t flag_wait;

	
	char* pinfo;
	uint16_t len;

	for( i = 0; i < no_of_attempts; i++ )
	{
		tick_start	= rt_tick_get( );
		tick_end	= tick_start + timeout;
		tm			= timeout;
		flag_wait=1;
		m66_write( &dev_gsm, 0, AT_cmd_string, strlen( AT_cmd_string ) );
		while( flag_wait )
		{
			err = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pmsg, tm );
			if( err != -RT_ETIMEOUT )                       /*没有超时,判断信息是否正确*/
			{
				len=(*pmsg<<8)|(*(pmsg+1));
				pinfo=pmsg+2;
				if( respfunc( pinfo, len ) == RT_EOK )    /*找到了*/
				{
					rt_free(pmsg);	/*释放*/
					return RT_EOK;
				} 
				rt_free(pmsg);	/*释放*/
				/*计算剩下的超时时间,由于其他任务执行的延时，会溢出,要判断*/
				if(rt_tick_get()<tick_end)	/*还没有超时*/
				{
					tm = tick_end-rt_tick_get();
				}
				else
				{
					flag_wait=0;
				}
			}else	/*已经超时*/
			{
				flag_wait=0;
			}
		}
	}
	return ( RT_ETIMEOUT );

}

/*
   判断一个字符串是不是表示ip的str
   如果由[0..9|.] 组成
   '.' 0x2e   '/' 0x2f   '0' 0x30  '9' 0x39   简化一下。不判断 '/'
   返回值
   0:表示域名的地址
   1:表示是IP地址

 */
static uint8_t is_ipaddr( char * str )
{
	char *p = str;
	while( *p != NULL )
	{
		if( ( *p > '9' ) || ( *p < '.' ) )
		{
			return 0;
		}
		p++;
	}
	return 1;
}

/*gsm供电的处理纤程*/

/**/
static int protothread_gsm_power( struct pt *pt )
{
	static AT_CMD_RESP		at_init[] =
	{
		{ RT_NULL,		   pt_resp_STR_OK, RT_TICK_PER_SECOND * 10, 1  },
		{ RT_NULL,		   pt_resp_STR_OK, RT_TICK_PER_SECOND * 10, 1  },
		{ "ATE0\r\n",	   pt_resp_STR_OK, RT_TICK_PER_SECOND * 5,	1  },
		{ "ATV1\r\n",	   pt_resp_STR_OK, RT_TICK_PER_SECOND * 5,	1  },
		{ "AT+CPIN?\r\n",  pt_resp_CPIN,   RT_TICK_PER_SECOND * 3,	10 },
		{ "AT+CREG?\r\n",  pt_resp_CGREG,  RT_TICK_PER_SECOND * 3,	10 },
		{ "AT+CIMI\r\n",   pt_resp_CIMI,   RT_TICK_PER_SECOND * 3,	1  },
		{ "AT+CGREG?\r\n", pt_resp_CGREG,  RT_TICK_PER_SECOND * 3,	10 },
		{ "AT+CGATT?\r\n", pt_resp_CGATT,  RT_TICK_PER_SECOND * 3,	10 },
	};
	static struct pt_timer	timer_gsm_power;
	static uint8_t			at_init_index	= 0;
	static uint8_t			at_init_retry	= 0;
	rt_err_t				ret;

	PT_BEGIN( pt );
	if( gsm_state == GSM_POWERON )
	{
		GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
		GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		pt_timer_set( &timer_gsm_power, 200 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) );
		GPIO_SetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		GPIO_SetBits( GSM_PWR_PORT, GSM_PWR_PIN );

		for( at_init_index = 0; at_init_index < sizeof( at_init ) / sizeof( AT_CMD_RESP ); at_init_index++ )
		{
			for( at_init_retry = 0; at_init_retry < at_init[at_init_index].retry; at_init_retry++ )
			{
				if( at_init[at_init_index].atcmd != RT_NULL )
				{
					rt_kprintf( "%08d gsm_send>%s", rt_tick_get( ), at_init[at_init_index].atcmd );
					m66_write( &dev_gsm, 0, at_init[at_init_index].atcmd, strlen( at_init[at_init_index].atcmd ) );
				}
				pt_timer_set( &timer_gsm_power, at_init[at_init_index].timeout );
				PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) || ( RT_EOK == pt_resp( at_init[at_init_index].resp ) ) );
				if( pt_timer_expired( &timer_gsm_power ) ) /*超时*/
				{
					rt_kprintf( "timeout\r\n" );
				}else
				{
					break;
				}
			}
			if( pt_timer_expired( &timer_gsm_power ) )  /*因为超时退出的*/
			{
				PT_EXIT( pt );
			}
		}
		gsm_state = GSM_AT;                             /*切换到AT状态*/
	}
	if( gsm_state == GSM_POWEROFF )
	{
		GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
		GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		gsm_state = GSM_IDLE;
	}
	PT_END( pt );
}

/*关于链路维护,只维护一个，多链路由上层处理*/
static int gsm_socket_process( struct pt *pt )
{
	uint8_t					buf[64];
	static struct pt_timer	timer_gsm_socket;
	static char				str_CGDCONT[64];
	static char				str_ETCPIP[32];
	static uint8_t			tcpip_init_index	= 0;
	static uint8_t			tcpip_init_retry	= 0;
	static uint8_t			dns_retry			= 0;

	static AT_CMD_RESP		tcpip_init[] = {
		{ str_CGDCONT,			 pt_resp_STR_OK, RT_TICK_PER_SECOND * 10, 1 },
		{ str_ETCPIP,			 pt_resp_STR_OK, RT_TICK_PER_SECOND * 30, 1 },
		{ "AT%ETCPIP?\r\n",		 pt_resp_ETCPIP, RT_TICK_PER_SECOND * 3,  1 },
		{ "AT%IOMODE=1,2,1\r\n", pt_resp_STR_OK, RT_TICK_PER_SECOND * 3,  1 },
	};

