GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/m66.c
	if( gsm_state != GSM_AT )
	{
		//return PT_ENDED;
		PT_EXIT( pt );
	}

	if( psocket == RT_NULL )
	{
		//return PT_ENDED;
		PT_EXIT( pt );
	}

	PT_BEGIN( pt );

	if( ( psocket->state == SOCKET_INIT ) || ( psocket->state == SOCKET_START ) )
	{
		tcpip_init_index = 0;

		if( psocket->state == SOCKET_START )
		{
			tcpip_init_index = 2;
		}

		sprintf( str_CGDCONT, "AT+CGDCONT=1,\"IP\",\"%s\"\r\n", psocket->apn );
		sprintf( str_ETCPIP, "AT%%ETCPIP=1,\"%s\",\"%s\"\r\n", psocket->user, psocket->psw );

		for( tcpip_init_index = 0; tcpip_init_index < sizeof( tcpip_init ) / sizeof( AT_CMD_RESP ); tcpip_init_index++ )
		{
			for( tcpip_init_retry = 0; tcpip_init_retry < tcpip_init[tcpip_init_index].retry; tcpip_init_retry++ )
			{
				if( tcpip_init[tcpip_init_index].atcmd != RT_NULL )
				{
					rt_kprintf( "%08d gsm_send>%s", rt_tick_get( ), tcpip_init[tcpip_init_index].atcmd );
					m66_write( &dev_gsm, 0, tcpip_init[tcpip_init_index].atcmd, strlen( tcpip_init[tcpip_init_index].atcmd ) );
				}
				pt_timer_set( &timer_gsm_socket, tcpip_init[tcpip_init_index].timeout );
				PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_socket ) || ( RT_EOK == pt_resp( tcpip_init[tcpip_init_index].resp ) ) );
				if( pt_timer_expired( &timer_gsm_socket ) ) /*超时*/
				{
					rt_kprintf( "timeout\r\n" );
				}else
				{
					break;
				}
			}
			if( pt_timer_expired( &timer_gsm_socket ) ) /*因为超时退出的*/
			{
				psocket->state = SOCKET_ETCPIP_ERROR;
				PT_EXIT( pt );
			}
		}
		/*AT的初始化完成，判断ip地址类型，域名还是IP*/

		if( is_ipaddr( psocket->ipstr ) ) /*是IP地址*/
		{
			psocket->state = SOCKET_CONNECT;
		}else
		{
			psocket->state = SOCKET_DNS;
		}
	}

	if( psocket->state == SOCKET_DNS )
	{
		for( dns_retry = 0; dns_retry < 4; dns_retry++ )
		{
			sprintf( buf, "AT%%DNSR=\"%s\"\r\n", psocket->ipstr );
			rt_kprintf( "%08d gsm_send>%s", rt_tick_get( ), buf );
			m66_write( &dev_gsm, 0, buf, sizeof( buf ) );
			pt_timer_set( &timer_gsm_socket, RT_TICK_PER_SECOND * 5 );
			PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_socket ) || ( RT_EOK == pt_resp( pt_resp_DNSR ) ) );
			if( pt_timer_expired( &timer_gsm_socket ) ) /*超时*/
			{
				rt_kprintf( "timeout\r\n" );
			}else
			{
				psocket->state = SOCKET_CONNECT;
				break;
			}
		}
		if( pt_timer_expired( &timer_gsm_socket ) ) /*超时*/
		{
			psocket->state = SOCKET_DNS_ERR;
		}
	}

	if( psocket->state == SOCKET_CONNECT )
	{
		if( psocket->type == 'u' )
		{
			sprintf( buf, "AT%%IPOPENX=%d,\"UDP\",\"%s\",%d\r\n", 1, psocket->ip_addr, psocket->port );
		}else
		{
			sprintf( buf, "AT%%IPOPENX=%d,\"TCP\",\"%s\",%d\r\n", 1, psocket->ip_addr, psocket->port );
		}
		rt_kprintf( "%08d gsm_send>%s", rt_tick_get( ), buf );
		m66_write( &dev_gsm, 0, buf, sizeof( buf ) );
		pt_timer_set( &timer_gsm_socket, RT_TICK_PER_SECOND * 35 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_socket ) || ( RT_EOK == pt_resp( pt_resp_IPOPENX ) ) );
		if( pt_timer_expired( &timer_gsm_socket ) ) /*超时*/
		{
			rt_kprintf( "timeout\r\n" );
			psocket->state = SOCKET_CONNECT_ERR;
		}else
		{
			psocket->state = SOCKET_READY;
			break;
		}
	}

	/*挂断连接*/
	if( psocket->state == SOCKET_CLOSE )
	{
	}

	PT_END( pt );
}

/*
   tts语音播报的处理

   是通过
   %TTS: 0 判断tts状态(怀疑并不是每次都有输出)
   还是AT%TTS? 查询状态
 */
void tts_process( void )
{
	rt_err_t	ret;
	rt_size_t	len;
	uint8_t		*pinfo, *p;
	uint8_t		c;

	uint8_t		buf[20];
	uint8_t		tbl[16] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };
/*当前正在播报中*/
	if( tts_busy == 1 )
	{
		return;
	}
/*是否有信息要播报*/
	ret = rt_mb_recv( &mb_tts, (rt_uint32_t*)&pinfo, 0 );
	if( ret == -RT_ETIMEOUT )
	{
		return;
	}
/*准备发送数据,判断gsm忙*/

	ret = rt_sem_take( &sem_gsmbusy, RT_TICK_PER_SECOND );
	if( ret != RT_EOK )
	{
		rt_kprintf( "\r\n%d>%s get sem timeout", rt_tick_get( ), __func__ );
		return;
	}
	sprintf( buf, "AT%%TTS=2,3,5,\"" );

	m66_write( &dev_gsm, 0, buf, strlen( buf ) );
	rt_kprintf( "%s", buf );

	len = ( *pinfo << 8 ) | ( *( pinfo + 1 ) );
	p	= pinfo + 2;
	while( len-- )
	{
		c = *p++;

		USART_SendData( UART4, tbl[c >> 4] );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		rt_kprintf( "%c", tbl[c >> 4] );
		USART_SendData( UART4, tbl[c & 0x0f] );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		rt_kprintf( "%c", tbl[c & 0x0f] );
	}
	buf[0]	= '"';
	buf[1]	= 0x0d;
	buf[2]	= 0x0a;
	buf[3]	= 0;
	m66_write( &dev_gsm, 0, buf, 3 );

	rt_sem_release( &sem_gsmbusy ); /*释放信号量*/

	rt_kprintf( "%s", buf );

/*不判断，在gsmrx_cb中处理*/

	rt_free( pinfo );
}

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[512];
struct rt_thread thread_gsm;


/*
   状态转换，同时处理短信、TTS、录音等过程
 */
static void rt_thread_entry_gsm( void* parameter )
{
	rt_tick_t		curr_ticks;
	rt_err_t		res;
	unsigned char	last_ch, ch;

	PT_INIT( &pt_gsm_power );
	PT_INIT( &pt_gsm_socket );

	while( 1 )
	{
		protothread_gsm_power( &pt_gsm_power ); /*处理开机*/
		gsm_socket_process( &pt_gsm_socket );   /*处理登网*/
		tts_process( );                         /*处理tts信息*/
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_rx_stack[512];
struct rt_thread thread_gsm_rx;


/***********************************************************
* Function:       rt_thread_entry_gsm_rx
* Description:    接收处理
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm_rx( void* parameter )
{
	rt_tick_t		curr_ticks;
	rt_err_t		res;
	unsigned char	last_ch, ch;

	while( 1 )
	{
		while( uart4_rxbuf_rd != uart4_rxbuf_wr ) /*有数据时，保存数据*/
		{
			ch				= uart4_rxbuf[uart4_rxbuf_rd++];
			uart4_rxbuf_rd	%= UART4_RX_SIZE;
			if( ch > 0x1F )
			{
				gsm_rx[gsm_rx_wr++] = ch;
				gsm_rx_wr			%= GSM_RX_SIZE;
				gsm_rx[gsm_rx_wr]	= 0;
			}
			if( ch == 0x0a )
			{
				if( gsm_rx_wr )
				{
					gsmrx_cb( gsm_rx, gsm_rx_wr );                  /*接收信息的处理函数*/
				}
				gsm_rx_wr = 0;
			}
		}
		if( rt_tick_get( ) - last_tick > RT_TICK_PER_SECOND / 10 )  //等待100ms,实际上就是变长的延时,最迟100ms处理完一个数据包
		{
			if( gsm_rx_wr )
			{
				gsmrx_cb( gsm_rx, gsm_rx_wr );                      /*接收信息的处理函数*/
				gsm_rx_wr = 0;
			}
		}
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gsm_init( void )
{
	rt_thread_t tid;

	rt_sem_init( &sem_gsmbusy, "sem_gsm", 0, RT_IPC_FLAG_FIFO );
	rt_sem_release( &sem_gsmbusy );

	rt_mb_init( &mb_gsmrx, "mb_gsmrx", &mb_gsmrx_pool, MB_GSMRX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );
	rt_mb_init( &mb_tts, "mb_tts", &mb_tts_pool, MB_TTS_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );

	rt_thread_init( &thread_gsm,
	                "gsm",
	                rt_thread_entry_gsm,
	                RT_NULL,
	                &thread_gsm_stack[0],
	                sizeof( thread_gsm_stack ), 7, 5 );
	rt_thread_startup( &thread_gsm );

